# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#
# Пример:
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

lst = [2,3,4, 5,6]
com = 1
k = len(lst)-1
for i in range(len(lst)):
    while i <= (len(lst)-1)/2:
        com = lst[i]*lst[k]
        print(com)
        i+=1
        k-=1
    else:
        break
